tap "buo/cask-upgrade"
tap "dopplerhq/cli" if [ $MACHINE == "work" ]
tap "homebrew/bundle"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"
brew "gnupg"
brew "gifski"
brew "rcm"
brew "ruby"
brew "dopplerhq/cli/doppler" if [ $MACHINE == "work" ]
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
brew "atuin"
brew "bun"
brew "corepack"
brew "composer"
brew "dockutil"
brew "elixir"
brew "flyctl"
brew "gh"
brew "git"
brew "go"
brew "jakehilborn/jakehilborn/displayplacer"
brew "neovim"
brew "node@20" if [ $MACHINE == "work" ]
brew "node"
brew "openai-whisper"
brew "whisper-cpp"
brew "pandoc"
brew "php"
brew "python"
brew "rcm"
brew "rust"
brew "sqlite"
brew "tldr"
brew "tmux"
brew "yqrashawn/goku/goku"
brew "zoxide"
cask "1password" unless [ $MACHINE == "work" ]
cask "arc"
cask "cleanshot" unless [ $MACHINE == "work" ]
cask "font-inter"
cask "font-poppins"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sf-compact"
cask "font-new-york"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-geist"
cask "font-geist"
cask "font-geist-mono"
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-hack"
cask "font-terminus"
cask "font-input"
cask "font-cascadia-code"
cask "font-jetbrains-mono"
cask "font-anonymous-pro"
cask "ecamm-live"
cask "1password-cli"
cask "mysides"
cask "visual-studio-code"
cask "ecamm-live"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "obs"
cask "tableplus"
cask "raycast"
cask "recut"
cask "rode-central"
cask "swiftdefaultappsprefpane"
cask "warp"
