tap "buo/cask-upgrade"
tap "dopplerhq/cli"
tap "homebrew/bundle"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"
brew "gnupg"
brew "rcm"
brew "dopplerhq/cli/doppler"
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
brew "atuin"
brew "bun"
brew "corepack"
brew "dockutil"
brew "elixir"
brew "flyctl"
brew "gh"
brew "git"
brew "go"
brew "jakehilborn/jakehilborn/displayplacer"
brew "neovim"
brew "node@22"
brew "openai-whisper"
brew "pandoc"
brew "php"
brew "python"
brew "rcm"
brew "rust"
brew "sqlite"
brew "tldr"
brew "tmux"
brew "yqrashawn/goku/goku"
brew "zoxide"
cask "font-inter"
cask "font-poppins"
cask "ecamm-live"
cask "1password-cli"
cask "mysides"
cask "visual-studio-code"
cask "ecamm-live"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "obs"
cask "tableplus"
cask "raycast"
cask "recut"
cask "rode-central"
cask "swiftdefaultappsprefpane"
